###################################################################

# Created by write_sdc on Thu Dec  4 23:41:50 2025

###################################################################
set sdc_version 2.1

set_units -time ns -resistance MOhm -capacitance fF -voltage V -current uA
set_max_area 0
set_ideal_network [get_ports rst_n]
create_clock [get_ports clk]  -period 10  -waveform {0 5}
set_clock_uncertainty -setup 3.5  [get_clocks clk]
set_input_delay -clock clk  1  [get_ports clk]
set_input_delay -clock clk  1  [get_ports rst_n]
set_input_delay -clock clk  1  [get_ports psel_i]
set_input_delay -clock clk  1  [get_ports penable_i]
set_input_delay -clock clk  1  [get_ports {paddr_i[11]}]
set_input_delay -clock clk  1  [get_ports {paddr_i[10]}]
set_input_delay -clock clk  1  [get_ports {paddr_i[9]}]
set_input_delay -clock clk  1  [get_ports {paddr_i[8]}]
set_input_delay -clock clk  1  [get_ports {paddr_i[7]}]
set_input_delay -clock clk  1  [get_ports {paddr_i[6]}]
set_input_delay -clock clk  1  [get_ports {paddr_i[5]}]
set_input_delay -clock clk  1  [get_ports {paddr_i[4]}]
set_input_delay -clock clk  1  [get_ports {paddr_i[3]}]
set_input_delay -clock clk  1  [get_ports {paddr_i[2]}]
set_input_delay -clock clk  1  [get_ports {paddr_i[1]}]
set_input_delay -clock clk  1  [get_ports {paddr_i[0]}]
set_input_delay -clock clk  1  [get_ports pwrite_i]
set_input_delay -clock clk  1  [get_ports {pwdata_i[31]}]
set_input_delay -clock clk  1  [get_ports {pwdata_i[30]}]
set_input_delay -clock clk  1  [get_ports {pwdata_i[29]}]
set_input_delay -clock clk  1  [get_ports {pwdata_i[28]}]
set_input_delay -clock clk  1  [get_ports {pwdata_i[27]}]
set_input_delay -clock clk  1  [get_ports {pwdata_i[26]}]
set_input_delay -clock clk  1  [get_ports {pwdata_i[25]}]
set_input_delay -clock clk  1  [get_ports {pwdata_i[24]}]
set_input_delay -clock clk  1  [get_ports {pwdata_i[23]}]
set_input_delay -clock clk  1  [get_ports {pwdata_i[22]}]
set_input_delay -clock clk  1  [get_ports {pwdata_i[21]}]
set_input_delay -clock clk  1  [get_ports {pwdata_i[20]}]
set_input_delay -clock clk  1  [get_ports {pwdata_i[19]}]
set_input_delay -clock clk  1  [get_ports {pwdata_i[18]}]
set_input_delay -clock clk  1  [get_ports {pwdata_i[17]}]
set_input_delay -clock clk  1  [get_ports {pwdata_i[16]}]
set_input_delay -clock clk  1  [get_ports {pwdata_i[15]}]
set_input_delay -clock clk  1  [get_ports {pwdata_i[14]}]
set_input_delay -clock clk  1  [get_ports {pwdata_i[13]}]
set_input_delay -clock clk  1  [get_ports {pwdata_i[12]}]
set_input_delay -clock clk  1  [get_ports {pwdata_i[11]}]
set_input_delay -clock clk  1  [get_ports {pwdata_i[10]}]
set_input_delay -clock clk  1  [get_ports {pwdata_i[9]}]
set_input_delay -clock clk  1  [get_ports {pwdata_i[8]}]
set_input_delay -clock clk  1  [get_ports {pwdata_i[7]}]
set_input_delay -clock clk  1  [get_ports {pwdata_i[6]}]
set_input_delay -clock clk  1  [get_ports {pwdata_i[5]}]
set_input_delay -clock clk  1  [get_ports {pwdata_i[4]}]
set_input_delay -clock clk  1  [get_ports {pwdata_i[3]}]
set_input_delay -clock clk  1  [get_ports {pwdata_i[2]}]
set_input_delay -clock clk  1  [get_ports {pwdata_i[1]}]
set_input_delay -clock clk  1  [get_ports {pwdata_i[0]}]
set_input_delay -clock clk  1  [get_ports awready_i]
set_input_delay -clock clk  1  [get_ports wready_i]
set_input_delay -clock clk  1  [get_ports {bid_i[3]}]
set_input_delay -clock clk  1  [get_ports {bid_i[2]}]
set_input_delay -clock clk  1  [get_ports {bid_i[1]}]
set_input_delay -clock clk  1  [get_ports {bid_i[0]}]
set_input_delay -clock clk  1  [get_ports {bresp_i[1]}]
set_input_delay -clock clk  1  [get_ports {bresp_i[0]}]
set_input_delay -clock clk  1  [get_ports bvalid_i]
set_input_delay -clock clk  1  [get_ports arready_i]
set_input_delay -clock clk  1  [get_ports {rid_i[3]}]
set_input_delay -clock clk  1  [get_ports {rid_i[2]}]
set_input_delay -clock clk  1  [get_ports {rid_i[1]}]
set_input_delay -clock clk  1  [get_ports {rid_i[0]}]
set_input_delay -clock clk  1  [get_ports {rdata_i[31]}]
set_input_delay -clock clk  1  [get_ports {rdata_i[30]}]
set_input_delay -clock clk  1  [get_ports {rdata_i[29]}]
set_input_delay -clock clk  1  [get_ports {rdata_i[28]}]
set_input_delay -clock clk  1  [get_ports {rdata_i[27]}]
set_input_delay -clock clk  1  [get_ports {rdata_i[26]}]
set_input_delay -clock clk  1  [get_ports {rdata_i[25]}]
set_input_delay -clock clk  1  [get_ports {rdata_i[24]}]
set_input_delay -clock clk  1  [get_ports {rdata_i[23]}]
set_input_delay -clock clk  1  [get_ports {rdata_i[22]}]
set_input_delay -clock clk  1  [get_ports {rdata_i[21]}]
set_input_delay -clock clk  1  [get_ports {rdata_i[20]}]
set_input_delay -clock clk  1  [get_ports {rdata_i[19]}]
set_input_delay -clock clk  1  [get_ports {rdata_i[18]}]
set_input_delay -clock clk  1  [get_ports {rdata_i[17]}]
set_input_delay -clock clk  1  [get_ports {rdata_i[16]}]
set_input_delay -clock clk  1  [get_ports {rdata_i[15]}]
set_input_delay -clock clk  1  [get_ports {rdata_i[14]}]
set_input_delay -clock clk  1  [get_ports {rdata_i[13]}]
set_input_delay -clock clk  1  [get_ports {rdata_i[12]}]
set_input_delay -clock clk  1  [get_ports {rdata_i[11]}]
set_input_delay -clock clk  1  [get_ports {rdata_i[10]}]
set_input_delay -clock clk  1  [get_ports {rdata_i[9]}]
set_input_delay -clock clk  1  [get_ports {rdata_i[8]}]
set_input_delay -clock clk  1  [get_ports {rdata_i[7]}]
set_input_delay -clock clk  1  [get_ports {rdata_i[6]}]
set_input_delay -clock clk  1  [get_ports {rdata_i[5]}]
set_input_delay -clock clk  1  [get_ports {rdata_i[4]}]
set_input_delay -clock clk  1  [get_ports {rdata_i[3]}]
set_input_delay -clock clk  1  [get_ports {rdata_i[2]}]
set_input_delay -clock clk  1  [get_ports {rdata_i[1]}]
set_input_delay -clock clk  1  [get_ports {rdata_i[0]}]
set_input_delay -clock clk  1  [get_ports {rresp_i[1]}]
set_input_delay -clock clk  1  [get_ports {rresp_i[0]}]
set_input_delay -clock clk  1  [get_ports rlast_i]
set_input_delay -clock clk  1  [get_ports rvalid_i]
set_output_delay -clock clk  1  [get_ports pready_o]
set_output_delay -clock clk  1  [get_ports {prdata_o[31]}]
set_output_delay -clock clk  1  [get_ports {prdata_o[30]}]
set_output_delay -clock clk  1  [get_ports {prdata_o[29]}]
set_output_delay -clock clk  1  [get_ports {prdata_o[28]}]
set_output_delay -clock clk  1  [get_ports {prdata_o[27]}]
set_output_delay -clock clk  1  [get_ports {prdata_o[26]}]
set_output_delay -clock clk  1  [get_ports {prdata_o[25]}]
set_output_delay -clock clk  1  [get_ports {prdata_o[24]}]
set_output_delay -clock clk  1  [get_ports {prdata_o[23]}]
set_output_delay -clock clk  1  [get_ports {prdata_o[22]}]
set_output_delay -clock clk  1  [get_ports {prdata_o[21]}]
set_output_delay -clock clk  1  [get_ports {prdata_o[20]}]
set_output_delay -clock clk  1  [get_ports {prdata_o[19]}]
set_output_delay -clock clk  1  [get_ports {prdata_o[18]}]
set_output_delay -clock clk  1  [get_ports {prdata_o[17]}]
set_output_delay -clock clk  1  [get_ports {prdata_o[16]}]
set_output_delay -clock clk  1  [get_ports {prdata_o[15]}]
set_output_delay -clock clk  1  [get_ports {prdata_o[14]}]
set_output_delay -clock clk  1  [get_ports {prdata_o[13]}]
set_output_delay -clock clk  1  [get_ports {prdata_o[12]}]
set_output_delay -clock clk  1  [get_ports {prdata_o[11]}]
set_output_delay -clock clk  1  [get_ports {prdata_o[10]}]
set_output_delay -clock clk  1  [get_ports {prdata_o[9]}]
set_output_delay -clock clk  1  [get_ports {prdata_o[8]}]
set_output_delay -clock clk  1  [get_ports {prdata_o[7]}]
set_output_delay -clock clk  1  [get_ports {prdata_o[6]}]
set_output_delay -clock clk  1  [get_ports {prdata_o[5]}]
set_output_delay -clock clk  1  [get_ports {prdata_o[4]}]
set_output_delay -clock clk  1  [get_ports {prdata_o[3]}]
set_output_delay -clock clk  1  [get_ports {prdata_o[2]}]
set_output_delay -clock clk  1  [get_ports {prdata_o[1]}]
set_output_delay -clock clk  1  [get_ports {prdata_o[0]}]
set_output_delay -clock clk  1  [get_ports pslverr_o]
set_output_delay -clock clk  1  [get_ports {awid_o[3]}]
set_output_delay -clock clk  1  [get_ports {awid_o[2]}]
set_output_delay -clock clk  1  [get_ports {awid_o[1]}]
set_output_delay -clock clk  1  [get_ports {awid_o[0]}]
set_output_delay -clock clk  1  [get_ports {awaddr_o[31]}]
set_output_delay -clock clk  1  [get_ports {awaddr_o[30]}]
set_output_delay -clock clk  1  [get_ports {awaddr_o[29]}]
set_output_delay -clock clk  1  [get_ports {awaddr_o[28]}]
set_output_delay -clock clk  1  [get_ports {awaddr_o[27]}]
set_output_delay -clock clk  1  [get_ports {awaddr_o[26]}]
set_output_delay -clock clk  1  [get_ports {awaddr_o[25]}]
set_output_delay -clock clk  1  [get_ports {awaddr_o[24]}]
set_output_delay -clock clk  1  [get_ports {awaddr_o[23]}]
set_output_delay -clock clk  1  [get_ports {awaddr_o[22]}]
set_output_delay -clock clk  1  [get_ports {awaddr_o[21]}]
set_output_delay -clock clk  1  [get_ports {awaddr_o[20]}]
set_output_delay -clock clk  1  [get_ports {awaddr_o[19]}]
set_output_delay -clock clk  1  [get_ports {awaddr_o[18]}]
set_output_delay -clock clk  1  [get_ports {awaddr_o[17]}]
set_output_delay -clock clk  1  [get_ports {awaddr_o[16]}]
set_output_delay -clock clk  1  [get_ports {awaddr_o[15]}]
set_output_delay -clock clk  1  [get_ports {awaddr_o[14]}]
set_output_delay -clock clk  1  [get_ports {awaddr_o[13]}]
set_output_delay -clock clk  1  [get_ports {awaddr_o[12]}]
set_output_delay -clock clk  1  [get_ports {awaddr_o[11]}]
set_output_delay -clock clk  1  [get_ports {awaddr_o[10]}]
set_output_delay -clock clk  1  [get_ports {awaddr_o[9]}]
set_output_delay -clock clk  1  [get_ports {awaddr_o[8]}]
set_output_delay -clock clk  1  [get_ports {awaddr_o[7]}]
set_output_delay -clock clk  1  [get_ports {awaddr_o[6]}]
set_output_delay -clock clk  1  [get_ports {awaddr_o[5]}]
set_output_delay -clock clk  1  [get_ports {awaddr_o[4]}]
set_output_delay -clock clk  1  [get_ports {awaddr_o[3]}]
set_output_delay -clock clk  1  [get_ports {awaddr_o[2]}]
set_output_delay -clock clk  1  [get_ports {awaddr_o[1]}]
set_output_delay -clock clk  1  [get_ports {awaddr_o[0]}]
set_output_delay -clock clk  1  [get_ports {awlen_o[3]}]
set_output_delay -clock clk  1  [get_ports {awlen_o[2]}]
set_output_delay -clock clk  1  [get_ports {awlen_o[1]}]
set_output_delay -clock clk  1  [get_ports {awlen_o[0]}]
set_output_delay -clock clk  1  [get_ports {awsize_o[2]}]
set_output_delay -clock clk  1  [get_ports {awsize_o[1]}]
set_output_delay -clock clk  1  [get_ports {awsize_o[0]}]
set_output_delay -clock clk  1  [get_ports {awburst_o[1]}]
set_output_delay -clock clk  1  [get_ports {awburst_o[0]}]
set_output_delay -clock clk  1  [get_ports awvalid_o]
set_output_delay -clock clk  1  [get_ports {wid_o[3]}]
set_output_delay -clock clk  1  [get_ports {wid_o[2]}]
set_output_delay -clock clk  1  [get_ports {wid_o[1]}]
set_output_delay -clock clk  1  [get_ports {wid_o[0]}]
set_output_delay -clock clk  1  [get_ports {wdata_o[31]}]
set_output_delay -clock clk  1  [get_ports {wdata_o[30]}]
set_output_delay -clock clk  1  [get_ports {wdata_o[29]}]
set_output_delay -clock clk  1  [get_ports {wdata_o[28]}]
set_output_delay -clock clk  1  [get_ports {wdata_o[27]}]
set_output_delay -clock clk  1  [get_ports {wdata_o[26]}]
set_output_delay -clock clk  1  [get_ports {wdata_o[25]}]
set_output_delay -clock clk  1  [get_ports {wdata_o[24]}]
set_output_delay -clock clk  1  [get_ports {wdata_o[23]}]
set_output_delay -clock clk  1  [get_ports {wdata_o[22]}]
set_output_delay -clock clk  1  [get_ports {wdata_o[21]}]
set_output_delay -clock clk  1  [get_ports {wdata_o[20]}]
set_output_delay -clock clk  1  [get_ports {wdata_o[19]}]
set_output_delay -clock clk  1  [get_ports {wdata_o[18]}]
set_output_delay -clock clk  1  [get_ports {wdata_o[17]}]
set_output_delay -clock clk  1  [get_ports {wdata_o[16]}]
set_output_delay -clock clk  1  [get_ports {wdata_o[15]}]
set_output_delay -clock clk  1  [get_ports {wdata_o[14]}]
set_output_delay -clock clk  1  [get_ports {wdata_o[13]}]
set_output_delay -clock clk  1  [get_ports {wdata_o[12]}]
set_output_delay -clock clk  1  [get_ports {wdata_o[11]}]
set_output_delay -clock clk  1  [get_ports {wdata_o[10]}]
set_output_delay -clock clk  1  [get_ports {wdata_o[9]}]
set_output_delay -clock clk  1  [get_ports {wdata_o[8]}]
set_output_delay -clock clk  1  [get_ports {wdata_o[7]}]
set_output_delay -clock clk  1  [get_ports {wdata_o[6]}]
set_output_delay -clock clk  1  [get_ports {wdata_o[5]}]
set_output_delay -clock clk  1  [get_ports {wdata_o[4]}]
set_output_delay -clock clk  1  [get_ports {wdata_o[3]}]
set_output_delay -clock clk  1  [get_ports {wdata_o[2]}]
set_output_delay -clock clk  1  [get_ports {wdata_o[1]}]
set_output_delay -clock clk  1  [get_ports {wdata_o[0]}]
set_output_delay -clock clk  1  [get_ports {wstrb_o[3]}]
set_output_delay -clock clk  1  [get_ports {wstrb_o[2]}]
set_output_delay -clock clk  1  [get_ports {wstrb_o[1]}]
set_output_delay -clock clk  1  [get_ports {wstrb_o[0]}]
set_output_delay -clock clk  1  [get_ports wlast_o]
set_output_delay -clock clk  1  [get_ports wvalid_o]
set_output_delay -clock clk  1  [get_ports bready_o]
set_output_delay -clock clk  1  [get_ports {arid_o[3]}]
set_output_delay -clock clk  1  [get_ports {arid_o[2]}]
set_output_delay -clock clk  1  [get_ports {arid_o[1]}]
set_output_delay -clock clk  1  [get_ports {arid_o[0]}]
set_output_delay -clock clk  1  [get_ports {araddr_o[31]}]
set_output_delay -clock clk  1  [get_ports {araddr_o[30]}]
set_output_delay -clock clk  1  [get_ports {araddr_o[29]}]
set_output_delay -clock clk  1  [get_ports {araddr_o[28]}]
set_output_delay -clock clk  1  [get_ports {araddr_o[27]}]
set_output_delay -clock clk  1  [get_ports {araddr_o[26]}]
set_output_delay -clock clk  1  [get_ports {araddr_o[25]}]
set_output_delay -clock clk  1  [get_ports {araddr_o[24]}]
set_output_delay -clock clk  1  [get_ports {araddr_o[23]}]
set_output_delay -clock clk  1  [get_ports {araddr_o[22]}]
set_output_delay -clock clk  1  [get_ports {araddr_o[21]}]
set_output_delay -clock clk  1  [get_ports {araddr_o[20]}]
set_output_delay -clock clk  1  [get_ports {araddr_o[19]}]
set_output_delay -clock clk  1  [get_ports {araddr_o[18]}]
set_output_delay -clock clk  1  [get_ports {araddr_o[17]}]
set_output_delay -clock clk  1  [get_ports {araddr_o[16]}]
set_output_delay -clock clk  1  [get_ports {araddr_o[15]}]
set_output_delay -clock clk  1  [get_ports {araddr_o[14]}]
set_output_delay -clock clk  1  [get_ports {araddr_o[13]}]
set_output_delay -clock clk  1  [get_ports {araddr_o[12]}]
set_output_delay -clock clk  1  [get_ports {araddr_o[11]}]
set_output_delay -clock clk  1  [get_ports {araddr_o[10]}]
set_output_delay -clock clk  1  [get_ports {araddr_o[9]}]
set_output_delay -clock clk  1  [get_ports {araddr_o[8]}]
set_output_delay -clock clk  1  [get_ports {araddr_o[7]}]
set_output_delay -clock clk  1  [get_ports {araddr_o[6]}]
set_output_delay -clock clk  1  [get_ports {araddr_o[5]}]
set_output_delay -clock clk  1  [get_ports {araddr_o[4]}]
set_output_delay -clock clk  1  [get_ports {araddr_o[3]}]
set_output_delay -clock clk  1  [get_ports {araddr_o[2]}]
set_output_delay -clock clk  1  [get_ports {araddr_o[1]}]
set_output_delay -clock clk  1  [get_ports {araddr_o[0]}]
set_output_delay -clock clk  1  [get_ports {arlen_o[3]}]
set_output_delay -clock clk  1  [get_ports {arlen_o[2]}]
set_output_delay -clock clk  1  [get_ports {arlen_o[1]}]
set_output_delay -clock clk  1  [get_ports {arlen_o[0]}]
set_output_delay -clock clk  1  [get_ports {arsize_o[2]}]
set_output_delay -clock clk  1  [get_ports {arsize_o[1]}]
set_output_delay -clock clk  1  [get_ports {arsize_o[0]}]
set_output_delay -clock clk  1  [get_ports {arburst_o[1]}]
set_output_delay -clock clk  1  [get_ports {arburst_o[0]}]
set_output_delay -clock clk  1  [get_ports arvalid_o]
set_output_delay -clock clk  1  [get_ports rready_o]
